
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Реализация.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реализация.Дата,
	|	Реализация.Контрагент,
	|	Реализация.Номер,
	|	Реализация.Склад,
	|	Реализация.ПереченьТоваров.(
	|		НомерСтроки,
	|		Товар,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПереченьТоваровШапка = Макет.ПолучитьОбласть("ПереченьТоваровШапка");
	ОбластьПереченьТоваров = Макет.ПолучитьОбласть("ПереченьТоваров");
	ОбластьИтог = Макет.ПолучитьОбласть("Всего");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПереченьТоваровШапка);
		ВыборкаПереченьТоваров = Выборка.ПереченьТоваров.Выбрать();
		СуммаИтог = 0;
		Пока ВыборкаПереченьТоваров.Следующий() Цикл
			ОбластьПереченьТоваров.Параметры.Заполнить(ВыборкаПереченьТоваров);
			ТабДок.Вывести(ОбластьПереченьТоваров, ВыборкаПереченьТоваров.Уровень());
		СуммаИтог = СуммаИтог + ВыборкаПереченьТоваров.Сумма;	
		КонецЦикла;
        ОбластьИтог.Параметры.ВсегоПоДокументу = СуммаИтог;
		ТабДок.Вывести(ОбластьИтог);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
