
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;  
	
	   
	//первоначальный вариант
	
	//СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	     
	 //введен общий модуль для расчета цены и количества
	 
	 РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
	
	  
 КонецПроцедуры   
 
 

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	 СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;  
		 
	 
	 РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);

	     
	КонецПроцедуры
